#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=d5b8019e988cf130c7b7cfd5968d1c70ded751cc]
null_resource.always_run: Refreshing state... [id=8449403586116442423]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=8699249497228776489]
proxmox_vm_qemu.k3s-manager-worker-01: Refreshing state... [id=milky-polaris/qemu/1002]
proxmox_vm_qemu.k3s-manager-controller-01: Refreshing state... [id=milky-capella/qemu/1001]
proxmox_vm_qemu.workstation-1: Refreshing state... [id=milky-polaris/qemu/123]
proxmox_vm_qemu.gateway-1: Refreshing state... [id=milky-capella/qemu/122]
proxmox_vm_qemu.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/qemu/2003]
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/2004]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/2005]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "8449403586116442423" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-10-18T15:24:39Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "8699249497228776489" -> (known after apply)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/2003"
        name                   = "solufit-cloudflare-tunnel-1"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/2004"
        name                   = "solufit-cloudflare-tunnel-2"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2005"
        name                   = "solufit-cloudflare-tunnel-3"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.gateway-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "gateway-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/122"
        name                   = "ssh-gateway-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
      + default_ipv4_address   = (known after apply)
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (64 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-01" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
      + default_ipv4_address   = (known after apply)
        id                     = "milky-capella/qemu/1001"
        name                   = "solufit-k3s-controller-01"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (63 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-01" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/1002"
        name                   = "solufit-k3s-worker-01"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (63 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.workstation-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "workstation-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/123"
        name                   = "workstation-1"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (63 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 9 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*